myz96/momento/apps/firmware/sdkconfig.defaults
# Seeed XIAO ESP32S3 Sense: 8 MB flash, 8 MB octal PSRAM
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Long file names on the SD card (PHOTO_QVGA.JPG is longer than 8.3)
CONFIG_FATFS_LFN_HEAP=y

# App image outgrew the default 1 MB factory partition (Wi-Fi + BLE + camera)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE provisioning (NimBLE host)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
